<pre>
<?php

  // 連想配列
  // 数値キーの代わりに文字列キーを使って管理する
  // $変数 = [キー1 => 値1, キー2 => 値2, ...... ]
  // 通常配列と同様にブラケット構文が利用できる
  $members = [
    '山田太郎' => '千葉県府中市東町1-1-1', 
    '掛谷翔太' => '広島県福岡市北町2-2-2',
    '日尾有宏' => '群馬県三次市南町3-3-3',
    '本多のぞみ' => '埼玉県豊田市西町4-4-4',
    '矢吹久美子' => '愛知県岡山市本町5-5-5',
  ];
  print $members['山田太郎'];
  print "<br>";
  print_r($members);
  print "<br>";


  // 2次元配列
  $data1 = [
    ['X-1', 'X-2', 'X-3'],
    ['Y-1', 'Y-2', 'Y-3'],
    ['Z-1', 'Z-2', 'Z-3'],
  ];
  print_r($data1);

  // 3次元配列
  $data2 = [
    [
      ['Sなし', 'Mなし', 'Lなし'],
      ['Sりんご', 'Mりんご', 'Lりんご'],
      ['S洋ナシ', 'M洋ナシ', 'L洋ナシ'],
    ],
    [
      ['Sもも', 'Mもも', 'Lもも'],
      ['Sすもも', 'Mすもも', 'Lすもも'],
      ['Sプラム', 'Mプラム', 'Lプラム'],
    ],
    [
      ['Sみかん', 'Mみかん', 'Lみかん'],
      ['S八朔', 'M八朔', 'L八朔'],
      ['Sネーブル', 'Mネーブル', 'Lネーブル'],
    ],
  ];
  print_r($data2);

  // 配列の中に連想配列の入れ子
  $data3 = [
    [
      'name'  => '山田太郎',
      'age'  => 35,
      'sex'  => '男',
    ],
    [
      'name'  => '鈴木二郎',
      'age'  => 30,
      'sex'  => '男',
    ],
    [
      'name'  => '佐藤花子',
      'age'  => 25,
      'sex'  => '女',
    ],
  ];
  print_r($data3);

  //
